blog/2021/use-xwmx-nb.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 18:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>使用 xwmx/nb</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">使用 xwmx/nb</h1>
</header>
<div id="outline-container-安装" class="outline-2">
<h2 id="安装">安装</h2>
<div class="outline-text-2" id="text-安装">
<pre class="example" id="orgabcd49f">
curl -o- https://raw.githubusercontent.com/nvm-sh/nvm/v0.38.0/install.sh | bash
export NVM_DIR="$([ -z "${XDG_CONFIG_HOME-}" ] &amp;&amp; printf %s "${HOME}/.nvm" || printf %s "${XDG_CONFIG_HOME}/nvm")"
[ -s "$NVM_DIR/nvm.sh" ] &amp;&amp; \. "$NVM_DIR/nvm.sh" # This loads nvm
nvm install --lts
npm install -g nb.sh
sudo "$(which nb)" completions install # install Bash and Zsh completion scripts (recommended)
</pre>
</div>
</div>

<div id="outline-container-用法" class="outline-2">
<h2 id="用法">用法</h2>
<div class="outline-text-2" id="text-用法">
<pre class="example" id="org85ad3ad">
nb add
nb &lt;url&gt;
nb edit &lt;id&gt;
nb show &lt;id&gt;
nb open &lt;id&gt;
nb list
nb search &lt;query&gt;
nb browse
nb notebooks add &lt;name&gt;
nb settings
nb help
</pre>
</div>
</div>

<div id="outline-container-用途" class="outline-2">
<h2 id="用途">用途</h2>
<div class="outline-text-2" id="text-用途">
<ul class="org-ul">
<li>命令行记笔记、为链接加书签、支持 Backlink</li>
<li>可同步至 GitHub，备份方便</li>
</ul>

<p>
ref:
</p>

<ol class="org-ol">
<li><a href="https://github.com/xwmx/nb">https://github.com/xwmx/nb</a></li>
<li><a href="https://xwmx.github.io/nb/">https://xwmx.github.io/nb/</a></li>
<li><a href="https://github.com/nvm-sh/nvm#installing-and-updating">https://github.com/nvm-sh/nvm#installing-and-updating</a></li>
</ol>
</div>
</div>
</div>
</body>
</html>